---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCOpeningData.OpeningElementId
source: html/8990c5d6-2007-5d60-95ff-3f59fac806d5.htm
---
# Autodesk.Revit.DB.IFC.IFCOpeningData.OpeningElementId Property

The opening element id.

## Syntax (C#)
```csharp
public ElementId OpeningElementId { get; }
```